In [2]:
import pandas as pd

In [32]:
# read in data file
input = pd.read_csv('data/4.csv', header=None)

In [33]:
# split existing columns by '-' character
input[2] = input[0].str.split(pat='-')
input[3] = input[1].str.split(pat='-')

input_ref = input[[2, 3]].copy()

In [34]:
# convert ranges to single ints
low1 = []
for i in input_ref[2]:
    low1.append(int(i[0]))

high1 = []
for i in input_ref[2]:
    high1.append(int(i[1]))

low2 = []
for i in input_ref[3]:
    low2.append(int(i[0]))

high2 = []
for i in input_ref[3]:
    high2.append(int(i[1]))

# convert single ints back to a dataframe
df_ref = pd.DataFrame({
    'low1':low1,
    'high1':high1,
    'low2':low2,
    'high2':high2
})

In [35]:
df_ref

     low1  high1  low2  high2
0      20     45    13     44
1       7      8     8     28
2       3     39    14     97
3      35     99    35     98
4      18     49    17     19
..    ...    ...   ...    ...
995    88     94    89     94
996    23     23    24     87
997    13     31    31     84
998    63     65     2     64
999    42     91    42     73

[1000 rows x 4 columns]

In [37]:
import numpy as np
df_ref['new1'] = np.where((df_ref['low1'] <= df_ref['low2']) & (
    df_ref['high1'] >= df_ref['high2']), 1, np.nan)

df_ref['new2'] = np.where((df_ref['low1'] >= df_ref['low2']) & (
    df_ref['high1'] <= df_ref['high2']), 1, np.nan)

In [43]:
df_ref.sum()

low1     31180.0
high1    67711.0
low2     29550.0
high2    67486.0
new1       216.0
new2       243.0
dtype: float64

In [44]:
df_ref[df_ref['new1'] == df_ref['new2']].count()

In [46]:
# Part 2

In [47]:
df_ref

     low1  high1  low2  high2  new1  new2
0      20     45    13     44   NaN   NaN
1       7      8     8     28   NaN   NaN
2       3     39    14     97   NaN   NaN
3      35     99    35     98   1.0   NaN
4      18     49    17     19   NaN   NaN
..    ...    ...   ...    ...   ...   ...
995    88     94    89     94   1.0   NaN
996    23     23    24     87   NaN   NaN
997    13     31    31     84   NaN   NaN
998    63     65     2     64   NaN   NaN
999    42     91    42     73   1.0   NaN

[1000 rows x 6 columns]

In [54]:
df_ref['low2'] >= df_ref['low1'] & df_ref['low2'] <= df_ref['high1']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
if low2 BETWEEN low 1 and high 1 : +1 

elif high2 BETWEEN low 1 and high 1 : +1

elif low1 BETWEEN low2 and high2 : +1
elif high1 BETWEEN low2 and high2 : +1

In [ ]:
df_ref['new1'] = np.where((df_ref['low1'] <= df_ref['low2']) & (
    df_ref['high1'] >= df_ref['high2']), 1, np.nan)

df_ref['new2'] = np.where((df_ref['low1'] >= df_ref['low2']) & (
    df_ref['high1'] <= df_ref['high2']), 1, np.nan)

In [52]:
df_ref.loc[df_ref['low2'] >= df_ref.loc[df_ref['low1']]]


# df_ref.loc[df_ref['low2'] >= df_ref.loc['low1'] & df_ref.loc['high1']]

/var/folders/rk/zdymd21x2774wstcyv1tg5ch0000gn/T/ipykernel_76590/2770672368.py:1: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  df_ref.loc[df_ref['low2'] >= df_ref.loc[df_ref['low1']]]

ValueError: Cannot index with multidimensional key

In [56]:
from pandas import DataFrame
 
numbers = {'mynumbers': [51, 52, 53, 54, 55]}
df = DataFrame(numbers, columns =['mynumbers'])
 
df.loc[df['mynumbers'] <= 53, '<= 53'] = 'True'
df.loc[df['mynumbers'] > 53, '<= 53'] = 'False'

In [50]:
df_ref

     low1  high1  low2  high2  new1  new2
0      20     45    13     44   NaN   NaN
1       7      8     8     28   NaN   NaN
2       3     39    14     97   NaN   NaN
3      35     99    35     98   1.0   NaN
4      18     49    17     19   NaN   NaN
..    ...    ...   ...    ...   ...   ...
995    88     94    89     94   1.0   NaN
996    23     23    24     87   NaN   NaN
997    13     31    31     84   NaN   NaN
998    63     65     2     64   NaN   NaN
999    42     91    42     73   1.0   NaN

[1000 rows x 6 columns]

In [55]:
df_ref

     low1  high1  low2  high2  new1  new2
0      20     45    13     44   NaN   NaN
1       7      8     8     28   NaN   NaN
2       3     39    14     97   NaN   NaN
3      35     99    35     98   1.0   NaN
4      18     49    17     19   NaN   NaN
..    ...    ...   ...    ...   ...   ...
995    88     94    89     94   1.0   NaN
996    23     23    24     87   NaN   NaN
997    13     31    31     84   NaN   NaN
998    63     65     2     64   NaN   NaN
999    42     91    42     73   1.0   NaN

[1000 rows x 6 columns]

In [ ]:
df_ref['new1'] = np.where((df_ref['low1'] <= df_ref['low2']) & (
    df_ref['high1'] >= df_ref['high2']), 1, np.nan)

df_ref['new2'] = np.where((df_ref['low1'] >= df_ref['low2']) & (
    df_ref['high1'] <= df_ref['high2']), 1, np.nan)

In [ ]:
if low1>= low2 and low1 <= high2 : 1
if high1 >= low2 and high1 <= high2 : 1
if low2 >= low1 and low2 <= high1 : 1
if high2 >= low1 and high2 <= high1 : 1

In [65]:
df_ref['new3'] = np.where((df_ref['low1'] >= df_ref['low2']) & (df_ref['low1'] <= df_ref['high2']), 1, np.nan)
df_ref['new4'] = np.where((df_ref['high1'] >= df_ref['low2']) & (df_ref['high1'] <= df_ref['high2']), 1, np.nan)
df_ref['new5'] = np.where((df_ref['low2'] >= df_ref['low1']) & (df_ref['low2'] <= df_ref['high1']), 1, np.nan)
df_ref['new6'] = np.where((df_ref['high2'] >= df_ref['low1']) & (df_ref['high2'] <= df_ref['high1']), 1, np.nan)

In [73]:
df_ref.fillna(value=0, inplace=True)

In [74]:
df_ref

     low1  high1  low2  high2  new1  new2  new3  new4  new5  new6  sum_new
0      20     45    13     44   0.0   0.0   1.0   0.0   0.0   1.0      0.0
1       7      8     8     28   0.0   0.0   0.0   1.0   1.0   0.0      0.0
2       3     39    14     97   0.0   0.0   0.0   1.0   1.0   0.0      0.0
3      35     99    35     98   1.0   0.0   1.0   0.0   1.0   1.0      0.0
4      18     49    17     19   0.0   0.0   1.0   0.0   0.0   1.0      0.0
..    ...    ...   ...    ...   ...   ...   ...   ...   ...   ...      ...
995    88     94    89     94   1.0   0.0   0.0   1.0   1.0   1.0      0.0
996    23     23    24     87   0.0   0.0   0.0   0.0   0.0   0.0      0.0
997    13     31    31     84   0.0   0.0   0.0   1.0   1.0   0.0      0.0
998    63     65     2     64   0.0   0.0   1.0   0.0   0.0   1.0      0.0
999    42     91    42     73   1.0   0.0   1.0   0.0   1.0   1.0      0.0

[1000 rows x 11 columns]

In [75]:
df_ref['sum_new'] = df_ref['new3'] + df_ref['new4'] + df_ref['new5'] + df_ref['new6']

In [83]:
df_ref['sum_new'].value_counts()

2.0    582
3.0    261
0.0    139
4.0     18
Name: sum_new, dtype: int64

In [85]:
print(f'Number of overlapped elves: {582+261+18}')

Number of overlapped elves: 861